LANGUAGES = {
    "german": "de", "english": "en", "french": "fr", "greek": "el", "russian": "ru",
    "arabic": "ar", "hindi": "hi", "armenian": "hy", "georgian": "ka", "hebrew": "he",
    "bengali": "bn", "tamil": "ta",
}

            #United kingdom
KEYBOARDS = {"en": [['q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p'],
                    ['a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l'],
                    ['z', 'x', 'c', 'v', 'b', 'n', 'm']],

            #German
             "de": [['ß'],
                    ['q', 'w', 'e', 'r', 't', 'z', 'u', 'i', 'o', 'p', 'ü'],
                    ['a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'ö', 'ä'],
                    ['y', 'x', 'c', 'v', 'b', 'n', 'm']],

            #French (Legacy, AZERTY)
             "fr": [['a', 'z', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p'],
                    ['q', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'm'],
                    ['w', 'x', 'c', 'v', 'b', 'n']],

            #Greek
             "el": [['ς', 'ε', 'ρ', 'τ', 'υ', 'θ', 'ι', 'ο', 'π'],
                    ['α', 'σ', 'δ', 'φ', 'γ', 'η', 'ξ', 'κ', 'λ'],
                    ['ζ', 'χ', 'ψ', 'ω', 'β', 'ν', 'μ']],

            #Russian
             "ru": [['ё'],
                    ['й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ'],
                    ['ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э'],
                    ['я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю']],

            #arabic 101
             "ar": [['لإ', 'إ'],
                    ['ض', 'ص', 'ث', 'ق', 'ف', 'غ', 'ع', 'ه', 'خ', 'ح', 'ج', 'د'],
                    ['لأ', 'أ'],
                    ['ش',  'س', 'ي', 'ب', 'ل', 'ا', 'ت', 'ن', 'م', 'ك', 'ط'],
                    ['لآ', 'آ'],
                    ['ئ', 'ء', 'ؤ', 'ر', 'لا', 'ى', 'ة', 'و', 'ز', 'ظ']],

            # hindi traditional
             "hi": [['ऍ', 'ॅ', '्र', 'र्', 'ज्ञ', 'त्र', 'क्ष', 'श्र', '', 'ः', 'ऋ'],
                    ['ृ'],
                    ['औ', 'ऐ', 'आ','ई', 'ऊ','भ', 'ङ', 'घ', 'ध','झ', 'ढ', 'ञ'],
                    ['ौ', 'ै',  'ा', 'ी',  'ू', 'ब', 'ह', 'ग', 'द',  'ज', 'ड',  '़'],
                    ['ओ', 'ए', 'अ', 'इ', 'उ', 'फ', 'ऱ', 'ख', 'थ', 'छ', 'ठ', 'ऑ'],
                    ['ो', 'े', '्', 'ि', 'ु', 'प', 'र', 'क', 'त', 'च', 'ट', 'ॉ'],
                    ['ऑ', '', 'ँ', 'ण', '', '', 'ळ', 'श', 'ष', '', 'य'],
                    ['ॉ', '', 'ं', 'म', 'न', 'व', 'ल', 'स', '', 'य़']],

            #armenian phonetic
             "hy": [['է', 'թ', 'փ', 'ձ', 'ջ', 'ւ', 'և', 'ր', 'չ', 'ճ', '', 'ժ'],
                    ['ք', 'ո', 'ե', 'ռ', 'տ', 'ը', 'ւ', 'ի', 'օ', 'պ', 'խ', 'ծ'],
                    ['ա', 'ս', 'դ', 'ֆ', 'գ', 'հ', 'յ', 'կ', 'լ'],
                    ['զ', 'ղ', 'ց', 'վ', 'բ', 'ն', 'մ']],

            # Georgian QWERTY
             "ka": [['ჭ', '', 'ღ', 'თ'],
                    ['ქ', 'წ', 'ე', 'რ', 'ტ', 'ყ', 'უ', 'ი', 'ო', 'პ'],
                    ['', 'შ', '', 'ჟ', ''],
                    ['ა', 'ს', 'დ', 'ფ', 'გ', 'ჰ', 'ჯ', 'კ', 'ლ'],
                    ['ძ', '', 'ჩ'],
                    ['ზ', 'ხ', 'ც', 'ვ', 'ბ', 'ნ', 'მ']],

            # Hebrew (Standard) Layout
             "he": [['ק', 'ר', 'א', 'ט', 'ו', 'ן', 'ם', 'פ'],
                    ['ש', 'ד', 'ג', 'כ', 'ע', 'י', 'ח', 'ל', 'ך','ף'],
                    ['ז', 'ס', 'ב', 'ה', 'נ', 'מ', 'צ', 'ת', 'ץ'],
                    ],

            # Bangla - INSCRIPT
             "bn": [['অ্যা', '', '্র', 'র্', 'জ্ঞ', 'ত্র', 'ক্ষ', 'শ্র', '', 'ঃ', 'ঋ'], #'' although ! and @ are in there but i only insert characters
                    ['ঔ', 'ঐ', 'আ', 'ঈ', 'ঊ', 'ভ', 'ঙ', 'ঘ', 'ধ', 'ঝ', 'ঢ', 'ঞ'],
                    ['ৌ', 'ৈ', 'া', 'ী', 'ূ', 'ব', 'হ', 'গ', 'দ', 'জ', 'ড', '়'],
                    ['ও', 'এ', 'অ', 'ই', 'উ', 'ফ', 'ৎ', 'খ', 'থ', 'ছ', 'ঠ'],
                    ['ো', 'ে', '্', 'ি', 'ু', 'প', 'র', 'ক', 'ত', 'চ', 'ট'],
                    ['ঁ', 'ণ', '', 'শ', 'ষ', '।', 'য'], # danda '।' also indicates end of sentence
                    ['ং', 'ম', 'ন', 'ব', 'ল', 'স', '', 'য়']],

            # Tamil 99
             "ta": [['ஸ', 'ஷ', 'ஜ', 'ஹ', 'க்ஷ', 'ஶ்ரீ', 'ஶ'],
                    ['ஆ', 'ஈ', 'ஊ', 'ஐ', 'ஏ', 'ள', 'ற', 'ன', 'ட', 'ண', 'ச', 'ஞ'],
                    ['௹', '௺', '௸', 'ஃ', 'எ', 'க', 'ப'],
                    ['அ', 'இ', 'உ', '்', 'எ', 'க', 'ப', 'ம', 'த', 'ந', 'ய'],
                    ['௳', '௴', '௵', '௶', '௷', 'ௐ'],
                    ['ஔ', 'ஓ', 'ஒ', 'வ', 'ங', 'ல', 'ர', '', 'ழ']
                    ],
             }
# KEYBOARD = KEYBOARDS[LANGUAGES[LANGUAGE]]

# do not include numbers as we do not want to change numbers
# line on QWERTY/Z: 5TGB. some tell its 6 and not 5 but 5 is the correct one. not neccessary here but for other languages, as up there are letters
LEFT_RIGHTS = {"en": {'left': ['q', 'w', 'e', 'r', 't', 'a', 's', 'd', 'f', 'g', 'z', 'x', 'c', 'v', 'b'],
                        'right': ['y', 'u', 'i', 'o', 'p', 'h', 'j', 'k', 'l', 'n', 'm']},

                "de": {'left': ['q', 'w', 'e', 'r', 't', 'a', 's', 'd', 'f', 'g', 'y', 'x', 'c', 'v', 'b'],
                        'right': ['ß', 'z', 'u', 'i', 'o', 'p', 'ü', 'h', 'j', 'k', 'l', 'ö', 'ä', 'n', 'm']},

                "fr": {'left': ['a', 'z', 'e', 'r', 't', 'q', 's', 'd', 'f', 'g', 'w', 'x', 'c', 'v', 'b'],
                        'right': ['y', 'u', 'i', 'o', 'p', 'h', 'j', 'k', 'l', 'm', 'n']},

                "el": {'left': ['ς', 'ε', 'ρ', 'τ', 'α', 'σ', 'δ', 'φ', 'γ', 'ζ', 'χ', 'ψ', 'ω', 'β'],
                        'right': ['υ', 'θ', 'ι', 'ο', 'π', 'η', 'ξ', 'κ', 'λ', 'ν', 'μ']},

                "ru": {'left': ['ё', 'й', 'ц', 'у', 'к', 'е', 'ф', 'ы', 'в', 'а', 'п', 'я', 'ч', 'с', 'м', 'и'],
                        'right': ['н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', 'р', 'о', 'л', 'д', 'ж', 'э', 'т', 'ь', 'б', 'ю']},

                "ar": {'left': ['لإ', 'ض', 'ص', 'ث', 'ق', 'ف', 'لأ', 'ش',  'س', 'ي', 'ب', 'ل', 'لآ', 'ئ', 'ء', 'ؤ', 'ر', 'لا'],
                        'right': ['إ', 'غ', 'ع', 'ه', 'خ', 'ح', 'ج', 'د', 'أ', 'ا', 'ت', 'ن', 'م', 'ك', 'ط', 'آ', 'ى', 'ة', 'و', 'ز', 'ظ']},

                "hi": {'left': ['ऍ', 'ॅ', '्र', 'र्', 'ज्ञ', 'औ', 'ऐ', 'आ','ई', 'ऊ', 'ौ', 'ै', 'ा', 'ी',  'ू', 'ओ', 'ए', 'अ', 'इ', 'उ', 'ो', 'े', '्', 'ि', 'ु', 'ऑ', 'ँ', 'ण', 'ॉ', 'ं', 'म', 'न', 'व'],
                        'right': ['त्र', 'क्ष', 'श्र', 'ः', 'ऋ', 'ृ', 'भ', 'ङ', 'घ', 'ध','झ', 'ढ', 'ञ', 'ब', 'ह', 'ग', 'द',  'ज', 'ड',  '़', 'फ', 'ऱ', 'ख', 'थ', 'छ', 'ठ', 'ऑ', 'प', 'र', 'क', 'त', 'च', 'ट', 'ॉ', 'ळ', 'श', 'ष', 'य', 'ल', 'स', 'य़']},

                "hy": {'left': ['է', 'թ', 'փ', 'ձ', 'ջ', 'ք', 'ո', 'ե', 'ռ', 'տ', 'ա', 'ս', 'դ', 'ֆ', 'գ', 'զ', 'ղ', 'ց', 'վ', 'բ'],
                        'right': ['ւ', 'և', 'ր', 'չ', 'ճ', 'ժ', 'ը', 'ւ', 'ի', 'օ', 'պ', 'խ', 'ծ', 'հ', 'յ', 'կ', 'լ', 'ն', 'մ']},

                "ka": {'left': ['ჭ', 'ღ', 'თ', 'ქ', 'წ', 'ე', 'რ', 'ტ', 'ა', 'ს', 'დ', 'ფ', 'გ', 'ძ', 'ჩ', 'ზ', 'ხ', 'ც', 'ვ', 'ბ'],
                        'right': ['ყ', 'უ', 'ი', 'ო', 'პ', 'ჰ', 'ჯ', 'კ', 'ლ', 'ნ', 'მ']},

                "he": {'left': ['ק', 'ר', 'א', 'ש', 'ד', 'ג', 'כ', 'ע', 'ז', 'ס', 'ב', 'ה', 'נ'],
                        'right': ['ט', 'ו', 'ן', 'ם', 'פ', 'י', 'ח', 'ל', 'ך','ף', ',', 'מ', 'צ', 'ת', 'ץ']},

                "bn": {'left': ['অ্যা', '্র', 'র্', 'জ্ঞ', 'ৌ', 'ৈ', 'া', 'ী', 'ূ', 'ও', 'এ', 'অ', 'ই', 'উ', 'ো', 'ে', '্', 'ি', 'ু',' ঁ', 'ণ', 'ং', 'ম', 'ন', 'ব'],
                        'right': ['ত্র', 'ক্ষ', 'শ্র', 'ঃ', 'ঋ', 'ব', 'হ', 'গ', 'দ', 'জ', 'ড', '়', 'ফ', 'ৎ', 'খ', 'থ', 'ছ', 'ঠ', 'প', 'র', 'ক', 'ত', 'চ', 'ট', 'শ', 'ষ', '।', 'য', 'ল', 'স', 'য়']},

                "ta": {'left': ['ஸ', 'ஷ', 'ஜ', 'ஹ', 'க்ஷ', 'ஆ', 'ஈ', 'ஊ', 'ஐ', 'ஏ', '௹', '௺', '௸', 'ஃ', 'எ', 'அ', 'இ', 'உ', '்', 'எ', '௳', '௴', '௵', '௶', '௷', 'ஔ', 'ஓ', 'ஒ', 'வ', 'ங'],
                        'right': ['ஶ்ரீ', 'ஶ', 'ள', 'ற', 'ன', 'ட', 'ண', 'ச', 'ஞ', 'க', 'ப', 'க', 'ப', 'ம', 'த', 'ந', 'ய', 'ௐ', 'ல', 'ர', 'ழ']},
              }
# LEFT_RIGHT = LEFT_RIGHTS[LANGUAGES[LANGUAGE]]

# IGNORING = True
IGNORES = {"en": {'zero', 'one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine', 'ten', 'eleven', 'twelve', 'thirteen', 'fifteen', 'twenty', 'thirty', 'forty', 'fifty', 'hundred', 'thousand', 'million', 'billion'
                  '1', '2', '3', '4', '5', '6', '7', '8', '9', '0'},

           "de": {'null', 'eins', 'zwei', 'drei', 'vier', 'fünf', 'sechs', 'sieben', 'acht', 'neun', 'zehn', 'elf', 'zwölf', 'zwanzig', 'sechzig', 'siebzig', 'hundert', 'tausend', 'million', 'milliarde',
                  '1', '2', '3', '4', '5', '6', '7', '8', '9', '0'},

           "fr": {'un', 'deux', 'trois', 'quatre', 'cinq', 'six', 'sept', 'huit', 'neuf', 'dix', 'onze', 'douze', 'treize', 'quatorze', 'quinze', 'seize', 'vingt', 'trente', 'quarante', 'soixante', 'cent', 'mille', 'million', 'milliard',
                  '1', '2', '3', '4', '5', '6', '7', '8', '9', '0'},

           #some numbers have several writings: εφτά & επτά, οχτώ & οκτώ, εννιά & ενιά & εννέα
           #focus on standard writing
           "el": {'εννιά', 'εννέα', 'δέκα', 'μηδέν', 'ένα', 'τριάντα', 'τρία', 'είκοσι', 'εκατό', 'έξι', 'πενήντα', 'δύο', 'πέντε', 'οκτώ', 'έντεκα', 'ογδόντα', 'τέσσερα', 'δώδεκα', 'ενενήντα', 'επτά', 'εβδομήντα', 'σαράντα', 'εξήντα', 'χίλια', 'εκατομμύριο', 'δισεκατομμύριο',
                   '1', '2', '3', '4', '5', '6', '7', '8', '9', '0'},

           "ru": {'шестнадцать', 'двести', 'четыре', 'сорок', 'два', 'три', 'шесть', 'семь', 'миллиард', 'десять', 'девятнадцать', 'четырнадцать', 'сто', 'девять', 'двенадцать', 'один', 'пятнадцать', 'тысяча', 'пять', 'миллион', 'семнадцать',
                  '1', '2', '3', '4', '5', '6', '7', '8', '9', '0'},

           "ar": {'وَاحِد', 'ثَلَاثُونَ', 'سِتُّونَ', 'أَلف', 'خَمْسَة', 'أَرْبَعُونَ', 'سِتَّة', 'سَبْعُونَ', 'أَرْبَعَة', 'ثَلَاثَة', 'ثَمَانِيَة', 'عَشَرَ', 'تِسْعَة', 'أَحَدَ', 'خَمْسُونَ', 'مِا۟ئَتَان', 'عِشْرُونَ', 'سَبْعَة', 'مِئَة', 'اِثْنَا', 'تِسْعُونَ', 'ثَمَانُونَ',
                    # '١', '٢', '٣', '٤', '٥', '٦', '٧', '٨', '٩', '٠', #not on the keyboard
                  '1', '2', '3', '4', '5', '6', '7', '8', '9', '0'},

           "hi": {'छियासी', 'बयासी', 'इकतालीस', 'चौरानवे', 'उनचास', 'एक', 'सत्तानवे', 'पचहत्तर', 'ग्यारह', 'पंद्रह', 'अट्ठाईस', 'तिरसठ', 'नवासी', 'अड़सठ', 'बहत्तर', 'उन्निस', 'पचपन', 'अठहत्तर', 'उनतालीस', 'तीन', 'सौ', 'पच्चीस', 'नब्बे', 'चालीस', 'दस', 'करोड़', 'तिहत्तर', 'अट्ठावन', 'छप्पन', 'सैंतालीस', 'छः', 'निन्यानवे', 'इक्यानबे', 'बाईस', 'चौंतालीस', 'चौहत्तर', 'चार', 'सात', 'चौबन', 'इक्याबन', 'सड़सठ', 'इकहत्तर', 'इक्यासी', 'साठ', 'तिरासी', 'अठासी', 'छिहत्तर', 'सत्रह', 'चौरासी', 'सत्तावन', 'लाख', 'छियानवे', 'अरब', 'नौ', 'इकसठ', 'बारह', 'उनसठ', 'सत्ताईस', 'तिरेपन', 'पैंतालीस', 'अड़तालीस', 'हज़ार', 'अस्सी', 'चौदह', 'तीस', 'सतासी', 'सतहत्तर', 'तेईस', 'चौंसठ', 'पांच', 'तिरानवे', 'बानवे', 'आठ', 'उनहत्तर', 'अट्ठारह', 'इक्कीस', 'बावन', 'तैंतालीस', 'सत्तर', 'सोलह', 'छियासठ', 'बीस', 'छियालीस', 'तेरह', 'पचास', 'बासठ', 'दो', 'पचानवे', 'उनासी', 'पैंसठ', 'अट्ठानवे', 'बयालीस',
                  '१', '२', '३', '४', '५', '६', '७', '८', '९','०', #lang-intern numbers only if they are on keyboard
                  '1', '2', '3', '4', '5', '6', '7', '8', '9', '0'},

           "hy": {'վաթսուն', 'քառասուն', 'իննսուն', 'երեսուն', 'վեց', 'չորս', 'միլիոն', 'երեք', 'տաս', 'ինը', 'քսան', 'հազար', 'ութ', 'հարյուր', 'հիսուն', 'միլիարդ', 'երկու', 'մեկ', 'յոթ', 'հինգ',
                  '1', '2', '3', '4', '5', '6', '7', '8', '9', '0'},

           "ka": {'ექვსი', 'რვა', 'თვრამეტი', 'თექვსმეტი', 'სამი', 'შვიდი', 'ჩვიდმეტი', 'მილიარდი', 'ათი', 'ცხრა', 'ასი', 'ოთხი', 'თოთხმეტი', 'მილიონი', 'თერთმეტი', 'ორი', 'ცამეტი', 'თხუთმეტი', 'ნული', 'ოცი', 'ერთი', 'ხუთი', 'თორმეტი',
                  '1', '2', '3', '4', '5', '6', '7', '8', '9', '0'},

           "he": {'מיליון', 'חמש', 'מיליארד', 'אחת', 'שמונה', 'שש', 'ארבע', 'שבע', 'אלף', 'אלפים', 'חמישים', 'אחד', 'מאה', 'שני', 'מאתיים', 'תשע', 'שישים', 'שתים', 'מאות', 'שתיים', 'עשר', 'שמונים', 'אלפיים', 'שמונת', 'שישה', 'שלוש', 'חמישה',
                  '1', '2', '3', '4', '5', '6', '7', '8', '9', '0'},

           "bn": {'তিন', 'এক', 'চল্লিশ', 'কোটি', 'পঁচিশ', 'ষোলো', 'হাজার', 'চৌদ্দ', 'শো', 'ঊনিশ', 'আশি', 'তেইশ', 'তিয়াত্তর', 'বাষট্টি', 'পঁয়তাল্লিশ', 'পঁয়তাল্লিশ', 'আঠার', 'সাত', 'লক্ষ', 'ছয়', 'সত্তর', 'চতুর্ভুজ', 'ষোল', 'পাঁচ', 'বাইস', 'দশ', 'পঞ্চাশ', 'নব্বই', 'ষাট', 'আট', 'চুয়াল্লিশ', 'এগার', 'চুরাশি', 'চার', 'তের', 'পনের', 'ছয়', 'বারো', 'নয়', 'বিশ', 'ত্রিশ', 'আঠাশ', 'দুই', 'নয়',
                  '১', '২', '৩', '৪', '৫', '৬', '৭', '৮', '৯', '০', #lang-intern numbers only if they are on keyboard
                  '1', '2', '3', '4', '5', '6', '7', '8', '9', '0'},

           "ta": {'ஒன்று', 'நான்கு', 'பத்து', 'இலட்சம்', 'இரண்டு', 'பதினேழு', 'எட்டு', 'நூறு', 'ஆயிரம்', 'பத்தொன்பது', 'ஏழு', 'ஐம்பது', 'பதினொன்று', 'ஆறு', 'ஐந்து', 'ஒன்பது', 'பதினாறு', 'மில்லியன்', 'தொன்னூறு', 'எழுபது', 'பதினைந்து', 'நாற்பது', 'பதினெட்டு', 'பூஜியம்', 'முப்பது', 'அறுபது', 'பதினான்கு', 'மூன்று', 'பன்னிரண்டு', 'எண்பது', 'இருபது', 'பில்லியன்',
                  '1', '2', '3', '4', '5', '6', '7', '8', '9', '0'},
           }
